---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomsWarn
source: html/f8f11f3c-4f0c-175f-b7c0-bdf2231b008b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomsWarn Property

Revit was unable to identify any rooms. If you are sure that rooms have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which rooms have been defined in your project.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRoomsWarn { get; }
```